Repository: altaf1512/MicrosleepMobile
Catalog: lib/l10n/intl_*.arb
Languages: id

# welcomeDriver
source: Good Morning, Driver
id: Selamat Pagi, Pengemudi

# monitoringSubtitle
source: Monitor microsleep and your trip in real-time.
id: Pantau kondisi microsleep dan perjalanan Anda secara real-time.

# monitoringActive
source: Realtime monitoring active
id: Monitoring realtime aktif

source: Microsleep Detected
id: Microsleep Terdeteksi

source: Driver Status
id: Status Pengemudi

source: Microsleep Duration
id: Durasi Microsleep

source: Battery
id: Baterai

source: IoT Device
id: Perangkat IoT

source: Device Status
id: Status Perangkat

# turnOffAlarm
source: Turn Off Alarm / Save to History
id: Matikan Alarm / Simpan Riwayat

source: Alarm stopped
id: Alarm dimatikan

# alarmDetected
source: Microsleep Detected!
id: Microsleep Terdeteksi!

# alarmInstruction
source: Stop the vehicle safely
id: Segera hentikan kendaraan dengan aman

source: History
id: Riwayat

source: Settings
id: Pengaturan

source: Location
id: Lokasi

source: Edit Profile
id: Edit Profil

source: Name
id: Nama

source: Address
id: Alamat

source: Age
id: Umur

# profile_name
source: Name
id: Nama

# profile_address
source: Address
id: Alamat

# profile_age
source: Age
id: Umur

source: Save
id: Simpan

source: Cancel
id: Batal

# sound
source: Warning Sound
id: Suara Peringatan

source: Vibration
id: Getaran

# tracking
source: Location Tracking
id: Pelacakan Lokasi

# soundDesc
source: Emergency alarm active
id: Alarm darurat aktif

# vibrationDesc
source: Vibrates on microsleep
id: Aktif saat microsleep

# trackingDesc
source: For rest area recommendation
id: Untuk rekomendasi rest area

source: Safe Days
id: Hari Aman

source: Total Incidents
id: Total Insiden

source: Monthly Improvement
id: Peningkatan Bulan Ini

source: Total Monitoring Hours
id: Total Jam Monitoring

source: Current Location
id: Lokasi Sekarang

source: Loading...
id: Memuat...

# noData
source: No data available
id: Tidak ada data

source: English
id: Bahasa Inggris

source: Indonesian
id: Bahasa Indonesia

source: Choose Language
id: Pilih Bahasa

# location_search_hint
source: Search rest area...
id: Cari rest area...

# location_tab_map
source: Map
id: Peta

# location_tab_list
source: List
id: Daftar

# location_alarm_test
source: Test Alarm
id: Tes Alarm

# location_alarm_title
source: Test Alarm
id: Tes Alarm

# location_alarm_body
source: Manual alarm successfully triggered.
id: Alarm manual berhasil dijalankan.

# location_waiting_data
source: Waiting for location data...
id: Menunggu data lokasi dari Firebase...

# location_panel_title
source: Your Location
id: Lokasi Anda

# location_latitude
source: Latitude
id: Lintang

# location_longitude
source: Longitude
id: Bujur

# location_speed
source: Speed
id: Kecepatan

# location_last_update
source: Last update
id: Terakhir diperbarui

# restarea_type
source: Highway Rest Area
id: Rest Area Tol

# restarea_24hours
source: 24 Hours
id: 24 Jam

# facility_food
source: Food
id: Makanan

# facility_parking
source: Parking
id: Parkir

# facility_fuel
source: Fuel
id: BBM

# history_search_hint
source: Search location or date...
id: Cari lokasi atau tanggal...

# history_no_data
source: No microsleep history.
id: Belum ada riwayat microsleep.

# history_title
source: Microsleep Detection
id: Deteksi Microsleep

# history_detail_info
source: Eyes closed for 3 consecutive seconds
id: Mata tertutup selama 3 detik berturut-turut

# history_date
source: Date
id: Tanggal

# history_location
source: Location
id: Lokasi

# history_duration
source: Duration
id: Durasi

# history_response
source: Response Time
id: Respons

source: Profile
id: Profil

source: Statistics
id: Statistik

# profile_edit_success
source: Profile updated successfully
id: Data berhasil diperbarui

# edit_cancel
source: Cancel
id: Batal

# edit_save
source: Save
id: Simpan

# settings_tab_profile
source: Profile
id: Profil

# settings_tab_stats
source: Statistics
id: Statistik

# alarm_sound
source: Warning Sound
id: Suara Peringatan

# alarm_sound_desc
source: Emergency alarm active
id: Alarm darurat aktif

# alarm_vibration
source: Vibration
id: Getaran

# alarm_vibration_desc
source: Active during microsleep
id: Aktif saat microsleep

# alarm_tracking
source: Location Tracking
id: Pelacakan Lokasi

# alarm_tracking_desc
source: Used for rest area recommendation
id: Untuk rekomendasi rest area

# stats_title
source: Driving Statistics
id: Statistik Berkendara

# stats_subtitle
source: Monitor your safety progress
id: Pantau kemajuan keamanan Anda

# stats_total_monitoring
source: Total Monitoring Hours
id: Total Jam Monitoring

# stats_safe_days
source: Safe Days
id: Hari Aman

# stats_total_incidents
source: Total Incidents
id: Total Insiden

# stats_monthly_improvement
source: Improvement This Month
id: Peningkatan Bulan Ini

# stats_total_hours
source: Total Monitoring Hours
id: Total Jam Monitoring
